app/controllers/accounts_controller.rb

SELECT * FROM "accounts" ORDER BY client_id, atype
---
  def index
    @accounts = Account.all(:include => :child, :order => 'child_id, atype')

SELECT * FROM "accounts" WHERE ("accounts"."id" = 1)
---
  def show
    @account = Account.find(params[:id])

INSERT INTO "accounts" ("created_at", "updated_at", "total", "client_id", "type") VALUES('2009-05-06 20:44:26', '2009-05-06 20:44:26', 0, 1, NULL)
---
  def create
    @account = Account.new(params[:account])

    respond_to do |format|
      if @account.save

SELECT * FROM "accounts" WHERE ("accounts"."id" = 15)
DELETE FROM "accounts" WHERE "id" = 15
---
  def destroy
    @account = Account.find(params[:id])
    @account.destroy

SELECT * FROM "accounts" WHERE ("accounts"."id" = 4)
UPDATE "accounts" SET "total" = 230, "updated_at" = '2009-05-16 22:49:20' WHERE "id" = 4
---
  def recalc_total
    @account = Account.find(params[:id])
    @account.recalc_total
    @account.save