app/controllers/clients_controller.rb

  def auto_complete_for_client_name
    @pattern = params[:client][:name].split
    @matches = Client.find(:all, :include => :accounts, :conditions => ['name like ?', "%#{@pattern.first}%"])
---
SELECT "accounts".* FROM "accounts" WHERE ("accounts".client_id IN (1,4,5,6,7))
SELECT * FROM "clients" WHERE (first_name like '%M%' or last_name like '%M%')

  def index
    if(params[:client])
      client = Client.find_by_name(params[:client][:name])
      if client
        redirect_to(client)
      else
        flash[:notice] = 'No client found'
        redirect_to(clients_path)
      end
      return
    end
    @clients = Client.all(:order => 'klass, name')
---
SELECT * FROM "clients" WHERE ("clients"."name" = 'Mads Buus Westmark') LIMIT 1
SELECT * FROM "clients" ORDER BY klass, name

  def byname
    @client = Client.find_by_name(params[:name], :include => :accounts)
---
SELECT * FROM "clients" WHERE ("clients"."name" = 'Mads Buus Westmark') LIMIT 1

  def show
    @client = Client.find(params[:id], :include => :accounts)
---
SELECT * FROM "accounts" WHERE ("accounts"."type" = 'bar') AND ("accounts".client_id = 5) LIMIT 1
SELECT * FROM "clients" WHERE ("clients"."id" = 1)

  def edit
    @client = Client.find(params[:id])
---
SELECT * FROM "clients" WHERE ("clients"."id" = 6)

  def create
    Client.transaction do
      @client = Client.new(params[:client])
      ['bar', 'mad', 'tur'].each do |atype|
        Account.create(:atype => atype, :client => @client, :total => 0)
---
INSERT INTO "accounts" ("created_at", "updated_at", "total", "client_id", "type") VALUES('2009-05-06 22:48:04', '2009-05-06 22:48:04', NULL, 3, NULL)
INSERT INTO "clients" ("created_at", "updated_at", "last_name", "first_name") VALUES('2009-05-06 19:25:17', '2009-05-06 19:25:17', 'Westmark', 'Mila Buus')

  def update
    @client = Client.find(params[:id])

    respond_to do |format|
      if @client.update_attributes(params[:client])
---
SELECT * FROM "clients" WHERE ("clients"."id" = 2)
UPDATE "clients" SET "updated_at" = '2009-05-08 10:46:35', "last_name" = 'Westmark' WHERE "id" = 2

  def destroy
    @client = Client.find(params[:id])
    @client.destroy
---
SELECT * FROM "clients" WHERE ("clients"."id" = 2)
DELETE FROM "clients" WHERE "id" = 2