app/controllers/lines_controller.rb

SELECT * FROM "clients" WHERE ("clients"."id" = 1)
SELECT "lines".* FROM "lines" WHERE ("lines".account_id = 2)
SELECT * FROM "accounts" WHERE ("accounts"."id" = 2)
---
  def index
    @client = Client.find(params[:client_id])
    @account = Account.find(params[:account_id], :include => :lines)