app/controllers/lines_controller.rb

SELECT * FROM "lines"
---
  def index
    if(params[:child_id])
      @child = Child.find(params[:child_id])
      @account = Account.find(params[:account_id], :include => :lines)
      @lines = @account.lines.find(:all, :limit => 100).reverse
    else
      #global lines link, show possible comments...
      @comments = Line.find(:all, :select =>  'distinct comment', :conditions => "comment is not null and comment != ''", :order => 'created_at desc')

      if params[:comment]
        @attendees = Child.find(:all, :include => :lines, :conditions => ['lines.comment = ?', params[:comment]], :order => :name)
        @comment = params[:comment] if @attendees.length > 0